app/controllers/entradas_controller.rb

SELECT "entradas".* FROM "entradas"
---
  def index
    @entradas = Entrada.all

INSERT INTO "entradas" ("ciudad", "colegio", "created_at", "email", "link_bloopers", "link_video", "nivel", "nombre", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @entrada = Entrada.new(entrada_params)

    respond_to do |format|
      if @entrada.save

UPDATE "entradas" SET "link_video" = $1, "link_bloopers" = $2, "updated_at" = $3 WHERE "entradas"."id" = 1  [["link_video", "https://www.youtube.com/watch?v=-DFl3oP00h4"], ["link_bloopers", "https://www.youtube.com/watch?v=-DFl3oP00h4"], ["updated_at", Tue, 16 Sep 2014 22:03:13 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @entrada.update(entrada_params)

SELECT "entradas".* FROM "entradas" WHERE "entradas"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_entrada
      @entrada = Entrada.find(params[:id])