app/controllers/home_controller.rb

SELECT "entradas".* FROM "entradas"
---
	def index
		@entrada = Entrada.new
		@entradas = Entrada.all